"use strict";
app
.factory("StoreType",	function () {

	var StoreType = {
			1 : {
				"name" : "ร้านค้า",
				"subType" : {
					1	:	"เสื้อผ้าแฟชั่น",
					2	:	"เครื่องประดับ",
					3	:	"เครื่องสำอาง",
					4	:	"กระเป๋า",
					5	:	"รองเท้า",
					6	:	"หมวก",
					7	:	"ร้านค้าปลีกทั่วไป",
					8	:	"อุปกรณ์กีฬา",
					9	:	"ร้านของฝาก",
					10	:	"แว่นตา",
					11	:	"ร้านยา",
					99	: "อื่นๆ"
				}
			},
			2 : {
				"name" : "ร้านอาหารและเครื่องดื่ม",
				"subType" : {
					1	:	"ร้านอาหารทั่วไป",
					2	:	"ร้านกาแฟ",
					3	:	"ร้านเบเกอร์รี่ / เค้ก",
					4	:	"ร้านน้ำผลไม้ปั่น",
					5	:	"ร้านอาหารญี่ปุ่น",
					6	:	"ร้านอาหารจีน",
					7	:	"ร้านอาหารเกาหลี",
					8	:	"ร้านอาหารเพื่อสุขภาพ",
					9	:	"Fast Food",
					10	:	"Food Truck",
					99	: 	"อื่นๆ"
				}
			},
			3 : {
				"name" : "ร้านเซอร์วิส",
				"subType" : {
					1	:	"ร้านตัดผม",
					2	:	"ฟิตเนส",
					3	:	"ร้านหมอฟัน",
					4	:	"ร้านทำเล็บ",
					5	:	"ร้านเกม",
					6	:	"ร้านสปา",
					7	:	"ติวเตอร์",
					99	: 	"อื่นๆ"
				}
			},
			4 : {
				"name" : "Co-working space",
				"subType" : {	
				}	
			},
			5 : {
				"name" : "ที่พัก",
				"subType" : {
					1	:	"โรงแรม",
					2	:	"โฮสเทล",
					3	:	"เกสเฮ้าส์",
					4	:	"คอนโดมิเนียม",
					5	:	"อพาร์ทเม้น",
					99	:	"อื่นๆ"
				}
			},
			99 : {
				"name" : "อื่นๆ",
				"subType" : {

				}
			}

		};
		 
		//  {
		//  	"id" : 1,
		//  	"name" : "ร้านค้า",
		//  	"subType" : [
		// 		{
		// 			"id" : 1,
		// 			"name" : "แว่นตา"
		// 		},
		// 		{
		// 			"id" : 2,
		// 			"name" : "เครื่องประดับ"
		// 		},
		// 		{
		// 			"id" : 3,
		// 			"name" : "เครื่องสำอาง"
		// 		},
		// 		{
		// 			"id" : 4,
		// 			"name" : "กระเป๋า"
		// 		},
		// 		{
		// 			"id" : 5,
		// 			"name" : "เสื้อผ้าแฟชั่น"
		// 		},
		// 		{
		// 			"id" : 6,
		// 			"name" : "รองเท้า"
		// 		},
		// 		{
		// 			"id" : 7,
		// 			"name" : "หมวก"
		// 		},
		// 		{
		// 			"id" : 8,
		// 			"name" : "อาหารสัตว์เลี้ยง"
		// 		},
		// 		{
		// 			"id" : 9,
		// 			"name" : "ร้านค้าปลีกทั่วไป"
		// 		},
		// 		{
		// 			"id" : 10,
		// 			"name" : "กิ๊ฟช้อป"
		// 		},
		// 		{
		// 			"id" : 11,
		// 			"name" : "ร้านของฝาก"
		// 		},
		// 		{
		// 			"id" : 12,
		// 			"name" : "ร้านอุปกรณ์เครื่องเขียน"
		// 		},
		// 		{
		// 			"id" : 13,
		// 			"name" : "ร้านเค้ก"
		// 		},
		// 		{
		// 			"id" : 14,
		// 			"name" : "ร้านหนังสือ"
		// 		},
		// 		{
		// 			"id" : 15,
		// 			"name" : "ร้านของเล่น"
		// 		},
		// 		{
		// 			"id" : 16,
		// 			"name" : "ร้านน้ำปั่นหรือน้ำ"
		// 		},
		// 		{
		// 			"id" : 17,
		// 			"name" : "ร้านยา"
		// 		},
		// 		{
		// 			"id" : 18,
		// 			"name" : "ร้านขายดอกไม้"
		// 		},
		// 		{
		// 			"id" : 0,
		// 			"name" : "อื่นๆ"
		// 		}
		// 	]		   
		//  },{
		//  	"id" : 2,
		//  	"name" : "ร้านอาหารและเครื่องดื่ม",
		//  	"subType" : [
		//  		{
		// 			"id" : 1,
		// 			"name" : "ร้านอาหารทั่วไป"
		// 		},
		// 		{
		// 			"id" : 2,
		// 			"name" : "ร้านกาแฟ"
		// 		},
		// 		{
		// 			"id" : 3,
		// 			"name" : "ร้านเบเกอร์รี่ เค้ก"
		// 		},
		// 		{
		// 			"id" : 4,
		// 			"name" : "ร้านอาหารเพื่อสุขภาพ"
		// 		},
		// 		{
		// 			"id" : 5,
		// 			"name" : "ร้านอาหารญี่ปุ่น"
		// 		},
		// 		{
		// 			"id" : 6,
		// 			"name" : "ร้านอาหารจีน"
		// 		},
		// 		{
		// 			"id" : 7,
		// 			"name" : "Fast Food"
		// 		},
		// 		{
		// 			"id" : 8,
		// 			"name" : "Food Truck"
		// 		},
		// 		{
		// 			"id" : 0,
		// 			"name" : "อื่นๆ"
		// 		}
		//  	]
		//  },{
		//  	"id" : 3,
		//  	"name" : "ร้านเซอร์วิส",
		//  	"subType" : [
		//  		{
		// 			"id" : 1,
		// 			"name" : "ร้านตัดผม"
		// 		},
		// 		{
		// 			"id" : 2,
		// 			"name" : "ฟิตเนส"
		// 		},
		// 		{
		// 			"id" : 3,
		// 			"name" : "ร้านหมอฟัน"
		// 		},
		// 		{
		// 			"id" : 4,
		// 			"name" : "ร้านทำเล็บ"
		// 		},
		// 		{
		// 			"id" : 5,
		// 			"name" : "ร้านเกม"
		// 		},
		// 		{
		// 			"id" : 6,
		// 			"name" : "ร้านสปา"
		// 		},
		// 		{
		// 			"id" : 7,
		// 			"name" : "ติวเตอร์"
		// 		},
		// 		{
		// 			"id" : 0,
		// 			"name" : "อื่นๆ"
		// 		}
		//  	]
		//  },{
		//  	"id" : 4,
		//  	"name" : "Co-working Space",
		//  	"subType" : [
		//  		{
		// 			"id" : 1,
		// 			"name" : "ออฟฟิตทั่วไป"
		// 		},
		// 		{
		// 			"id" : 2,
		// 			"name" : "Co-working space"
		// 		},
		// 		{
		// 			"id" : 3,
		// 			"name" : "ตึกสำนักงาน"
		// 		},
		// 		{
		// 			"id" : 0,
		// 			"name" : "อื่นๆ"
		// 		}
		//  	]
		//  },{
		//  	"id" : 5,
		//  	"name" : "ที่พัก",
		//  	"subType" : [
		//  		{
		// 			"id" : 1,
		// 			"name" : "โรงแรม"
		// 		},
		// 		{
		// 			"id" : 2,
		// 			"name" : "โฮสเทล"
		// 		},
		// 		{
		// 			"id" : 3,
		// 			"name" : "เกสเฮ้าส์"
		// 		},
		// 		{
		// 			"id" : 4,
		// 			"name" : "คอนโดมิเนียม"
		// 		},
		// 		{
		// 			"id" : 5,
		// 			"name" : "อพาร์ทเม้น"
		// 		},
		// 		{
		// 			"id" : 6,
		// 			"name" : "อื่นๆ"
		// 		}
		//  	]
		//  },{
		//  	"id" : 0,
		//  	"name" : "อื่นๆ"
		//  }
		

		// ];

	return StoreType;
});